[
    {
        "simplified": "游戏",
        "traditional": "遊戲",
        "pinyin": "yóu xì",
        "definition": "noun recreation; game 做遊戲 Zuò yóuxì play games \nverb play 孩子們在公園裡遊戲。 Háizi men zài gōngyuán lǐ yóuxì. The children are playing in the park."
    },
    {
        "simplified": "革新",
        "traditional": "革新",
        "pinyin": "gé xīn",
        "definition": "noun innovation; renovation 技術革新 jìshù géxīn technological innovation \nverb innovate; improve 傳統的手工藝技術不斷革新。 Chuántǒng de shǒu gōngyì jìshù bùduàn géxīn. Traditional handicraft techniques are being steadily improved."
    },
    {
        "simplified": "单身狗",
        "traditional": "單身狗",
        "pinyin": "dān shēn gǒu",
        "definition": "(Internet slang) person who is neither married nor in a relationship (used self-deprecatingly)"
    },
    {
        "simplified": "老弟",
        "traditional": "老弟",
        "pinyin": "lǎo dì",
        "definition": "noun [familiar form of address to a man somewhat younger than oneself] young man (or fellow); my boy"
    },
    {
        "simplified": "本事",
        "traditional": "本事",
        "pinyin": "běn shi",
        "definition": "noun skill; ability; capability 本領大 běnlǐng dà highly skilled; very capable 掌握專業本領 zhǎngwò zhuānyè běnlǐng master the skills needed for one’s occupation 凡是想要的東西他都有本領弄到手。 fánshì xiǎngyào de dōngxi tā dōu yǒu běnlǐng nòngdào shǒu. He is resourceful enough to get whatever he wants."
    },
    {
        "simplified": "一线之隔",
        "traditional": "一線之隔",
        "pinyin": "yī xiàn zhī gé",
        "definition": "1 a fine line 2 a fine distinction"
    },
    {
        "simplified": "白痴",
        "traditional": "白痴",
        "pinyin": "bái chī",
        "definition": "noun 1 idiocy 2 idiot"
    },
    {
        "simplified": "环境",
        "traditional": "環境",
        "pinyin": "huán jìng",
        "definition": "noun environment; surroundings; circumstances 環境順利 huánjìng shùnlì under favourable circumstances 換換環境 huàn huàn huánjìng have a change of environment; a change of scene 如環境許可 rú huánjìng xǔkě if circumstances permit 為環境所迫 wéi huánjìng suǒ pò forced by circumstances 改善投資環境 gǎishàn tóuzī huánjìng improve the investment environment 在艱苦的環境中成長 zài jiānkǔ de huánjìng zhōng chéngzhǎng grow up under tough conditions 創造適宜的經濟和社會環境 Chuàngzào shìyí de jīngjì hé shèhuì huánjìng create a favourable economic and social environment"
    },
    {
        "simplified": "载具",
        "traditional": "載具",
        "pinyin": "zài jù",
        "definition": "1 conveyance (car, boat, aircraft etc); vehicle 2 (fig.) medium; platform; vector 3 (Tw) (Taiwan pr. [zǎijù]) a consumer's device (smart card or mobile app barcode etc) that can be scanned at checkout to save the receipt 統一發票tǒngyīfāpiào [統一發票] to a cloud account"
    },
    {
        "simplified": "竟是",
        "traditional": "竟是",
        "pinyin": "jìng shì",
        "definition": "居然是。表示出乎意料之外。 直到戰後, 同伴們才知道花木蘭竟是女兒身 這次考上明星學校的竟是一名平時成績中上等的同學。"
    },
    {
        "simplified": "旅馆",
        "traditional": "旅館",
        "pinyin": "lǚ guǎn",
        "definition": "noun inn; hotel 住旅館 zhù lǚguǎn check in (or stay) at a hotel 退旅館 tuì lǚguǎn check out at (or leave) a hotel"
    },
    {
        "simplified": "丝",
        "traditional": "絲",
        "pinyin": "sī",
        "definition": "noun 1 silk 2 threadlike thing 銅絲 tóngsī copper wire (蜘)蛛絲 zhīzhūsī thread spun by a spider; cobweb 把土豆切成細絲兒 bǎ tǔdòu qiē chéng xì sīr cut the potatoes into fine shreds; shred the potatoes 3 stringed instruments See 30756096絲竹si1zhu2絲竹 \nmeasure word 1 a thread or shred of 一絲亮光 yī sī liàngguāng a thread of light 這盤菜裡一絲兒肉也見不著。 Zhè pán cài lǐ yī sīr ròu yě jiàn bu zháo. Not a single shred of meat can be found in this dish. 2 si a a traditional unit of length, equal to 0.00001 chi (市尺), and equivalent to 3.333 microns b a traditional unit of weight, equal to 0.000001 jin (市斤), and equivalent to 0.5 milligram or 0.0075 grain 3 a tiny bit; trace 一絲不差 yīsībùchà not a bit of difference 一絲風也沒有。 Yī sī fēng yě méiyǒu. There isn’t a breath of air. 她臉上沒有一絲笑容。 Tā liǎnshàng méiyǒu yī sī xiàoróng. There isn’t a trace of a smile on her face. 4 one ten-thousandth of certain units of measure See 30753024絲米si1mi3絲米"
    }
]